package main

import (
	"fmt"
)

func main() {
	var s = []string{"1", "2", "3"} // создали слайс
	modifySlice(s)                  // передали его не по ссылке
	fmt.Println(s)                  // {3, 2, 3}
}

func modifySlice(i []string) {
	i[0] = "3"         // {3, 2, 3} - все еще старый слайс
	i = append(i, "4") // {3, 2, 3} || {3, 2, 3, 4} - создали новый слайс и добавили элемент
	i[1] = "5"         // {3, 2, 3} || {3, 5, 3, 4} - модифицируем новый слайс
	i = append(i, "6") // {3, 2, 3} || {3, 5, 3, 4, 6} - добавили элемент в новый слайс
}
